<a href="https://colab.research.google.com/github/Law101/python_for_ML_project/blob/master/Introduction_to_Python_for_Machine_Learning.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Inroduction to Python for Machine Learning
Name: Lawrence Okegbemi

### Load Neccessary Libraries

In [1]:
import numpy as np              # For numerical python computation
import pandas as pd             # For handling tabular dataset
import matplotlib.pyplot as plt # Plotting and Visualization
import seaborn as sns           # Plotting and Visualization

%matplotlib inline

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

### Import the Dataset

In [2]:
# Get the Data from URL
url = "https://raw.githubusercontent.com/WalePhenomenon/climate_change/master/fuel_ferc1.csv"
dataset = pd.read_csv(url )

In [3]:
dataset.head()

                record_id  ...  fuel_cost_per_mmbtu
0   f1_fuel_1994_12_1_0_7  ...                1.121
1  f1_fuel_1994_12_1_0_10  ...                1.120
2   f1_fuel_1994_12_2_0_1  ...                1.650
3   f1_fuel_1994_12_2_0_7  ...                1.970
4  f1_fuel_1994_12_2_0_10  ...                2.570

[5 rows x 11 columns]

### Exploratory Data Analysis

In [4]:
# Shape of the dataset with ROWS X COLUMNS Respectively
dataset.shape

(29523, 11)

In [5]:
# Information about the Columns in the dataset
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29523 entries, 0 to 29522
Data columns (total 11 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   record_id                     29523 non-null  object
 1   utility_id_ferc1              29523 non-null  int64
 2   report_year                   29523 non-null  int64
 3   plant_name_ferc1              29523 non-null  object
 4   fuel_type_code_pudl           29523 non-null  object
 5   fuel_unit                     29343 non-null  object
 6   fuel_qty_burned               29523 non-null  float64
 7   fuel_mmbtu_per_unit           29523 non-null  float64
 8   fuel_cost_per_unit_burned     29523 non-null  float64
 9   fuel_cost_per_unit_delivered  29523 non-null  float64
 10  fuel_cost_per_mmbtu           29523 non-null  float64
dtypes: float64(5), int64(2), object(4)
memory usage: 2.5+ MB

In [6]:
#Descriptions about the Data
dataset.describe(include="all")

                    record_id  ...  fuel_cost_per_mmbtu
count                   29523  ...         29523.000000
unique                  29523  ...                  NaN
top     f1_fuel_2014_12_7_5_4  ...                  NaN
freq                        1  ...                  NaN
mean                      NaN  ...            19.304354
std                       NaN  ...          2091.540939
min                       NaN  ...           -41.501000
25%                       NaN  ...             1.940000
50%                       NaN  ...             4.127000
75%                       NaN  ...             7.745000
max                       NaN  ...        359278.000000

[11 rows x 11 columns]

<b>1. If you’re given two lists:

   `A = [1,2,3,4,5,6], B = [13, 21, 34]`

   The task is to create a list with the elements of A and B in a single dimension with output:

   `A_B =  [1,2,3,4,5,6,13, 21, 34]`

   Which of the following option is the best way to create this list?</b>

In [10]:
A, B = [1,2,3,4,5,6], [13, 21, 34]

In [8]:
# Best way
A_B = A + B
print(A_B)

[1, 2, 3, 4, 5, 6, 13, 21, 34]

In [9]:
# This will not return any value to A_B but will append B as the last value  in A
A_B  = A.append(B)
print(A)
print(A_B)

[1, 2, 3, 4, 5, 6, [13, 21, 34]]
None

In [11]:
# This will will not return any value, instead it will perform an inplace operation on A
A_B = A.extend(B)
print(A)
print(A_B)

[1, 2, 3, 4, 5, 6, 13, 21, 34]
None

**2. How do you create an identity matrix in python?**

In [12]:
 np.identity(3)

array([[1., 0., 0.],
       [0., 1., 0.],
       [0., 0., 1.]])

**3. Which of the following fuel type code has the lowest average fuel cost per unit burned?**

In [13]:
dataset.groupby('fuel_type_code_pudl').mean()['fuel_cost_per_unit_burned'].idxmin()

'gas'

**4. What is the standard deviation and 75th percentile of the measure of energy per unit (Fuel_mmbtu_per_unit) in two decimal places?**

In [14]:
dataset.describe(include='all')[['fuel_mmbtu_per_unit']].T[['std','75%']]

                          std     75%
fuel_mmbtu_per_unit  10.60022  17.006

**5. What is the skewness and kurtosis for the fuel quantity burned in two decimal places?**

In [15]:
print('Skewness', dataset[['fuel_qty_burned']].skew())
print('kurtosis', dataset[['fuel_qty_burned']].kurtosis())

Skewness fuel_qty_burned    15.851495
dtype: float64
kurtosis fuel_qty_burned    651.36945
dtype: float64

<b> 6. Which feature has missing values and what is the total number of missing value and percentage of the missing rows as a factor of the total number of rows in three decimal places? 

(Enter answer in the format: Feature: xxx, Total: xxx, Percent: xxx)</b>

In [16]:
# Locate Column with Missing Values
dataset.isnull().sum()

record_id                         0
utility_id_ferc1                  0
report_year                       0
plant_name_ferc1                  0
fuel_type_code_pudl               0
fuel_unit                       180
fuel_qty_burned                   0
fuel_mmbtu_per_unit               0
fuel_cost_per_unit_burned         0
fuel_cost_per_unit_delivered      0
fuel_cost_per_mmbtu               0
dtype: int64

In [17]:
# Percentage(%) of missing rows
(180/len(dataset['fuel_unit']))*100

0.609694136774718

**7. The feature with missing values falls under what category? What missing value imputation technique would you use?**

In [18]:
# Categorical and mode imputation

**8. Which of the features has the second and third lowest correlation with the Fuel Cost Per Unit Burned?**

In [19]:
dataset.corr()[['fuel_cost_per_unit_burned']].sort_values(by=['fuel_cost_per_unit_burned'], ascending=True)

                              fuel_cost_per_unit_burned
utility_id_ferc1                              -0.037863
fuel_qty_burned                               -0.018535
fuel_mmbtu_per_unit                           -0.010034
fuel_cost_per_mmbtu                           -0.000437
fuel_cost_per_unit_delivered                   0.011007
report_year                                    0.013599
fuel_cost_per_unit_burned                      1.000000

**9. For the fuel type coal, what is the percentage change in the fuel cost per unit burned in 1998 compared to 1994?**

In [20]:
dataset.groupby(['fuel_type_code_pudl','report_year']).sum()[['fuel_cost_per_unit_burned']]

                                 fuel_cost_per_unit_burned
fuel_type_code_pudl report_year
coal                1994                         14984.572
                    1995                         14571.785
                    1996                         12694.803
                    1997                         43742.178
                    1998                         11902.597
...                                                    ...
waste               2014                           591.594
                    2015                           629.270
                    2016                           539.079
                    2017                           452.079
                    2018                           660.972

[148 rows x 1 columns]

In [21]:
((11902.597 - 14984.572)/14984.572)*100

-20.567654518260518

**10. Which year has the highest average fuel cost per unit delivered?**

In [22]:
dataset.groupby(['report_year']).mean()[['fuel_cost_per_unit_delivered']].idxmax()

fuel_cost_per_unit_delivered    1997
dtype: int64